cont_error = {
    1: "ОШИБКА: НАЗВАНИЕ ДОЛЖНО СОСТОЯТЬ МИНИМУМ ИЗ 3-Х СИМВОЛОВ!",
    2: "ОШИБКА: ОПИСАНИЕ ДОЛЖНО СОСТОЯТЬ МИНИМУМ ИЗ 3-Х СИМВОЛОВ!",
    3: "ОШИБКА: НАЗВАНИЕ ДОЛЖНО СОСТОЯТЬ ИЗ РУССКИХ СИМВОЛОВ!",
    4: "ОШИБКА: ОПИСАНИЕ ДОЛЖНО СОСТОЯТЬ ИЗ РУССКИХ СИМВОЛОВ!",
    5: "ОШИБКА: НАЗВАНИЕ ДОЛЖНО ИМЕТЬ ОТ 3-х ДО 15 символов!",
    6: "ОШИБКА: НУМЕРАЦИЯ КАТЕГОРИИ ОТ 1 ДО 8!",
    7: "Ошибка входа. Проверьте имя пользователя и пароль."
}

cont_info = {
    1: "ТОВАР УСПЕШНО ДОБАВЛЕН!",
    2: "НУЖНО ЗАГРУЗИТЬ ФОТО!"
}
